Revit 2026 API

# CompoundStructureIsSimpleRegion Method

---

Determines whether the region is a simple region in this CompoundStructure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSimpleRegion(
	int regionId
)
```
```vb
Public Function IsSimpleRegion (
	regionId As Integer
) As Boolean
```
```cpp
public:
bool IsSimpleRegion(
	int regionId
)
```
```fsharp
member IsSimpleRegion :
        regionId : int -> bool
```

#### Parameters

regionId Int32
     The id of a region in this vertically compound structure.

#### Return Value

Boolean True if the region is simple, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | It is not a valid region id. |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

A region is simple if it rectangular and spans the height of the wall.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace